alembic-init:
	alembic init src/migrations

# чтобы получилось, как в видео, нужно в файле .env указать название нашей пустой БД
# (sa_alembic), но у меня все равно создавалась пустая миграция, хотя я удалила весь
# pycache из всех папок и подпапок, потом я в файле config.py вывела название БД
# на печать (позже удалила этот принт), и тогда у меня создалась не пустая миграция,
# а все как на видео, а в pgadmin4 у БД sa_alembic появилась таблица alembic_version
makemig:
	alembic revision --autogenerate
